In [24]:
import numpy as np
import pandas as pd

In [ ]:
#import text/csv file into a dataframe

In [25]:
df = pd.read_csv('Sample.txt',sep="|")

In [26]:
df

    Name  Age Sex
0   Mike   42   M
1   Jill   56   M
2    Jim   25   M
3  Steve   38   M

In [ ]:
#use the first column in the data frame as index

In [27]:
df = pd.read_csv('Sample.txt',sep="|",index_col=0)

In [28]:
df

       Age Sex
Name
Mike    42   M
Jill    56   M
Jim     25   M
Steve   38   M

In [29]:
df.to_csv("Sample_nex_text.txt")

In [ ]:
#write a data frame with default indexs

In [30]:
df = pd.read_csv('Sample.txt',sep="|")
df

    Name  Age Sex
0   Mike   42   M
1   Jill   56   M
2    Jim   25   M
3  Steve   38   M

In [31]:
df.to_csv("Sample_nex_text.txt")

# Write dataframe to csv without the default index-- Below ---
#df.to_csv("Sample_nex_text.txt",sep="|",index=False)

In [ ]:
#reading and writing Excel files 
# note: This will only read data from the excel file, Macros and functions will not be present

In [32]:
df = pd.read_excel("Sample_Excel.xlsx",sheet_name="Sample_sheet")

In [33]:
df

   Name  Age Sex
0  jack   32   M
1  emma   32   F
2   ken   37   M
3   rob   34   M
4  tina   30   F

In [35]:
df.to_excel("sample_excel_new.xlsx",index=False)

In [ ]:
# check out not to import from SQL tables, etc.